import random

def capital_game():
    countries_capitals = {
        '대한민국': '서울',
        '미국': '워싱턴 D.C.',
        '일본': '도쿄',
        '중국': '베이징',
        '영국': '런던',
        '프랑스': '파리',
        '독일': '베를린',
        '이탈리아': '로마',
        '캐나다': '오타와',
        '호주': '캔버라',
        '러시아': '모스크바',
        '인도': '뉴델리',
        '브라질': '브라질리아',
        '아르헨티나': '부에노스아이레스',
        '멕시코': '멕시코시티',
        '사우디아라비아': '리야드',
        '남아프리카공화국': '프리토리아',
        '이집트': '카이로',
        '터키': '앙카라',
        '이란': '테헤란',
        '태국': '방콕',
        '스페인': '마드리드',
        '네덜란드': '암스테르담',
        '스위스': '베른',
        '그리스': '아테네',
        '벨기에': '브뤼셀',
        '오스트리아': '비엔나',
        '노르웨이': '오슬로',
        '스웨덴': '스톡홀름',
        '덴마크': '코펜하겐',
        '핀란드': '헬싱키',
        '포르투갈': '리스본',
        '폴란드': '바르샤바',
        '체코': '프라하',
        '헝가리': '부다페스트',
        '아일랜드': '더블린',
        '우크라이나': '키예프',
        '루마니아': '부쿠레슈티',
        '뉴질랜드': '웰링턴',
        '말레이시아': '쿠알라룸푸르',
        '필리핀': '마닐라',
        '싱가포르': '싱가포르',
        '인도네시아': '자카르타',
        '베트남': '하노이',
        '칠레': '산티아고',
        '콜롬비아': '보고타',
        '베네수엘라': '카라카스',
        '페루': '리마'
    }
    countries = list(countries_capitals.keys())

    players = ['민주', '주형', '하영', '용화', '영헌']
    current_player = 0

    while True:
        country = random.choice(countries)
        capital = countries_capitals[country]
        answer = input("{}님, {}의 수도는 어디일까요? ".format(players[current_player], country))
        if answer == capital:
            print("어케알았노!")
            current_player = (current_player + 1) % len(players)
        else:
            print("땡. 한 잔 마시세요~ {}의 수도는 {}이거든~".format(country, capital))
            break

capital_game()
